
// let imya = prompt ("Введіть ваше ім'я");
// let surname = prompt ("Введіть вашу фамілію");
// let age = prompt ("Введіть ваш вік");


// document.write("<header>"+imya + "<br>" +surname+"<br>"+age+"</header>");

// // Получите 3 числа от пользователя и выведите среднее арифметическое

// let calc1 = prompt ("Введіть перше число");
// let calc2 = prompt ("Введіть друге число");
// let calc3 = prompt ("Введіть трєте число");
// let parse1 = parseFloat(calc1);
// let parse2 = parseFloat(calc2);
// let parse3 = parseFloat(calc3);

// let seredne = ((parse1+parse2+parse3)/3); 
// let content = "<div>"+"<nav>"+"</nav>"+"<section>"+seredne +"</section>"+"</div>";

// document.write(content);
// document.write ("<footer>");

//  Создайте 3 переменных ( x = 6, y = 14, z =4 ) 
// Выполните и отобразите результат следующих операций для этих переменных:
// x += y - x++ * z ;
// z = --x - y * 5 ;
// y /= x + 5 % z;
// z - x++ + y * 5;
// x = y - x++ * z;
// Дайте ответ как джаваскрипт выполнил расчет каждой операции.

let x = 6, y = 14, z =4; 
let res = x += y - x++ * z;
// document.write(res); 
document.write("Перша операція: " +res+ "<br>"); 
// крок 1: розрахунок додавання, але через один шаг, так як постфиксний інкремент
// крок 2: виконується множення на z
// крок 3: виконується додаввання та присвоєння
// крок 4: виконується віднімання (тобто ліва части мінус права частина (20-24))

x = 6, y = 14, z =4; 
let res2 =  z = --x - y * 5;
document.write("Друга операція: "+res2+ "<br>");
// крок 1: розраховується префіксий декремент, тобто віднімається одиниця від нашшого значення х=6
// крок 2: операція множення
// крок 3: операція віднімання (5 - 70)

x = 6, y = 14, z =4; 
let res3 =  y /= x + 5 % z; 
document.write("Трєтя операція: "+res3+ "<br>");
// крок 1: ділення та присвоєння
// крок 2: залишок від ділення
// крок 3: додавання
// крок 4: 14/6=2.3 5%4 = 1 

x = 6, y = 14, z =4; 
let res4 = z - x++ + y * 5;  
document.write("Четверта операція: "+res4+ "<br>");
// крок 1: розрахунок постфіксоного інкремента
// крок 2: множення
// крок 3: віднімання
// крок 4: додавання

x = 6, y = 14, z =4; 
let res5 =  x = y - x++ * z;  
document.write("П'ята операція: "+res5+ "<br>");
// крок 1: розрахунок постфіксоного інкремента (на наступного кроці тут ми його не рахуємо)
// крок 2: множення
// крок 3: віднімання
// крок 4: присвоєння



